# Questions [40marks]
* Q1 Who did spend most money for renting?
* Q2 Which room does make the most amount of income?
* Q3 How many time Jack Jones rent the room?
* Q4 What are the roomss rented by Claire Taylor?
* Q5 what is the total income of ALL rooms in June? Between 1st June 2018(inclusive) and 30th June 2018(inclusive), (use return date).
* Q6 What are the total incomes of EACH room in June? Between 1st June 2018(inclusive) and 30th June 2018(inclusive), (use return date) 
* Q7 Find members that have total rent time exactly 8 hours in June?
* Q8 Find members that have total rent time greater than or equal than 9 hours in June?
* Q9 Find the total rent duration of EACH room in June?
* Q10 Find the total income of EACH room in June?

# คำถาม [ข้อละ 4 คะแนน รวม 40 คะแนน]
* Q1 ใครจ่ายเงินค่าเช่ามากที่สุด
* Q2 ห้องเช่าใดทำรายได้มากที่สุด
* Q3 Jack Jones เช่าห้องไปกี่ครั้ง
* Q4 Claire Taylor เช่าห้องไปกี่ครั้ง
* Q5 ในเดือนมิถุนายนมีรายรับรวมเท่าใด
* Q6 ในเดือนมิถุนายนแต่ละห้องมีรายรับรวมเท่าใด
* Q7 หาชื่อสมาชิกที่เช่าห้อง 8 ชั่วโมงในเดือนมิถุนายน
* Q8 หาชื่อสมาชิกที่เช่าห้องมากกว่าหรือเท่ากับ 9 ชั่วโมงในเดือนมิถุนายน
* Q9 หาระยะเวลาเช่ารวมของแต่ละห้องในเดือนมิถุนายน
* Q10 หารายได้รวมของแต่ละห้องในเดือนมิถุนายน

In [1]:
import pandas as pd
from pytz import datetime as dt

In [2]:
member_df = pd.read_csv('member.csv')
member_df.drop(['Unnamed: 0','mobile'],axis=1,inplace =True)
rent_df = pd.read_csv('rent.csv')
rent_df.drop(['Unnamed: 0'],axis=1,inplace =True)
room_df = pd.read_csv('room.csv')
room_df.drop(['Unnamed: 0','isavailable'],axis=1,inplace =True)

In [3]:
member_df.head()

   id            name
0   1  Oscar Williams
1   2     James Jones
2   3   Claire Thomas
3   4  Oliver Johnson
4   5    Oliver Jones

In [4]:
rent_df.head()

,id,start,stop,member_id,room_id,cost
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0
1,384,2018-05-09 08:01:18.462109,2018-05-09 10:01:18.462109,1,9,260.0
2,385,2018-05-09 09:01:18.462109,2018-05-09 10:01:18.462109,67,10,199.0
3,386,2018-05-09 10:01:18.462109,2018-05-09 12:01:18.462109,18,7,200.0
4,387,2018-05-09 12:01:18.462109,2018-05-09 15:01:18.462109,86,6,315.0

In [5]:
room_df

   id  number  hour_price
0   6     101         105
1   7     102         100
2   8     103         170
3   9     104         130
4  10     105         199

In [6]:
rent_df.count()

id           3427
start        3427
stop         3426
member_id    3427
room_id      3427
cost         3426
dtype: int64

In [7]:
member_df.count()

id      100
name    100
dtype: int64

In [8]:
rent_df.merge(member_df,left_on='member_id',right_on='id').head(10)

,id_x,start,stop,member_id,room_id,cost,id_y,name
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,48,Thomas Thomas
1,395,2018-05-09 22:01:18.462109,2018-05-09 23:01:18.462109,48,6,105.0,48,Thomas Thomas
2,396,2018-05-09 23:01:18.462109,2018-05-10 00:01:18.462109,48,6,105.0,48,Thomas Thomas
3,777,2018-05-26 06:01:18.462109,2018-05-26 10:01:18.462109,48,6,420.0,48,Thomas Thomas
4,971,2018-06-03 08:01:18.462109,2018-06-03 13:01:18.462109,48,10,995.0,48,Thomas Thomas
5,1057,2018-06-07 07:01:18.462109,2018-06-07 12:01:18.462109,48,8,850.0,48,Thomas Thomas
6,1378,2018-06-20 17:01:18.462109,2018-06-20 20:01:18.462109,48,10,597.0,48,Thomas Thomas
7,1453,2018-06-24 03:01:18.462109,2018-06-24 06:01:18.462109,48,6,315.0,48,Thomas Thomas
8,1770,2018-07-07 14:01:18.462109,2018-07-07 15:01:18.462109,48,6,105.0,48,Thomas Thomas
9,1814,2018-07-09 05:01:18.462109,2018-07-09 07:01:18.462109,48,6,210.0,48,Thomas Thomas

In [9]:
df=rent_df.merge(member_df,left_on='member_id',right_on='id')\
.drop(labels=['id_y'],axis=1).merge(room_df,left_on='room_id',right_on='id')\
.drop(labels=['id'],axis=1)

In [10]:
df.head()

,id_x,start,stop,member_id,room_id,cost,name,number,hour_price
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,Thomas Thomas,102,100
1,1839,2018-07-10 12:01:18.462109,2018-07-10 13:01:18.462109,48,7,100.0,Thomas Thomas,102,100
2,2676,2018-08-16 01:01:18.462109,2018-08-16 02:01:18.462109,48,7,100.0,Thomas Thomas,102,100
3,3044,2018-08-31 02:01:18.462109,2018-08-31 03:01:18.462109,48,7,100.0,Thomas Thomas,102,100
4,3105,2018-09-02 13:01:18.462109,2018-09-02 16:01:18.462109,48,7,300.0,Thomas Thomas,102,100

# Q1

In [11]:
df.groupby(by=['member_id','name'])\
    .agg({'cost' : ['sum']})\
    .sort_values(('cost','sum'),ascending=False)\
    .head(1)

                          cost
                           sum
member_id name
94        Oscar Smith  15116.0

In [12]:
df.groupby(by=['member_id','name'])

# Q2

In [13]:
df.groupby(by=['room_id','number'])\
    .agg({'cost' : ['sum']})\
    .sort_values(('cost','sum'),ascending=False)\
    .head(1)

                    cost
                     sum
room_id number
10      105     269645.0

# Q3

In [14]:
df.iloc[1]

id_x                                1839
start         2018-07-10 12:01:18.462109
stop          2018-07-10 13:01:18.462109
member_id                             48
room_id                                7
cost                                 100
name                       Thomas Thomas
number                               102
hour_price                           100
Name: 1, dtype: object

In [15]:
len(df[df['name']=='Jack Jones'])

35

# Q4

In [16]:
len(df[df['name']=='Claire Taylor'])

35

In [17]:
x=pd.to_datetime(df.start,format='%Y-%m-%d %H:%M:%S')

In [18]:
df['start']=pd.to_datetime(df.start,format='%Y-%m-%d %H:%M:%S')
df['stop']=pd.to_datetime(df.stop,format='%Y-%m-%d %H:%M:%S')

In [19]:
df.start[0]

Timestamp('2018-05-09 08:01:18.462109')

In [20]:
df.head()

,id_x,start,stop,member_id,room_id,cost,name,number,hour_price
0,383,2018-05-09 08:01:18.462109,2018-05-09 09:01:18.462109,48,7,100.0,Thomas Thomas,102,100
1,1839,2018-07-10 12:01:18.462109,2018-07-10 13:01:18.462109,48,7,100.0,Thomas Thomas,102,100
2,2676,2018-08-16 01:01:18.462109,2018-08-16 02:01:18.462109,48,7,100.0,Thomas Thomas,102,100
3,3044,2018-08-31 02:01:18.462109,2018-08-31 03:01:18.462109,48,7,100.0,Thomas Thomas,102,100
4,3105,2018-09-02 13:01:18.462109,2018-09-02 16:01:18.462109,48,7,300.0,Thomas Thomas,102,100

# Q5

In [21]:
price=0
for i in range(len(df)):
    if df['stop'][i].month==6:
        price+=df['cost'][i]

In [22]:
price

196236.0

In [24]:
newdf = df[df['stop']<'2018-07-01']
newdf = newdf[newdf['stop']>='2018-06-01']
newdf = newdf[newdf['start']<'2018-07-01']
newdf = newdf[newdf['start']>='2018-06-01']
sum(newdf['cost'])

195936.0

# Q6

In [25]:
room6=0.0
room7=0.0
room8=0.0
room9=0.0
room10=0.0
for i in range(len(df)):
    if df['stop'][i].month==6:
        if df['room_id'][i]==6:
            room6+=df['cost'][i]
        elif df['room_id'][i]==7:
            room7+=df['cost'][i]
        elif df['room_id'][i]==8:
            room8+=df['cost'][i]
        elif df['room_id'][i]==9:
            room9+=df['cost'][i]
        else:
            room10+=df['cost'][i]

In [26]:
print(f'room6: {room6}')
print(f'room7: {room7}')
print(f'room8: {room8}')
print(f'room9: {room9}')
print(f'room10: {room10}')
print(f'total cost: {room6+room7+room8+room9+room10}')

room6: 30135.0
room7: 30400.0
room8: 48450.0
room9: 37700.0
room10: 49551.0
total cost: 196236.0

In [27]:
newdf.groupby(by=['room_id','number']).agg({'cost' : ['sum']})

                   cost
                    sum
room_id number
6       101     30135.0
7       102     30100.0
8       103     48450.0
9       104     37700.0
10      105     49551.0

# Q7

In [28]:
for i in range(len(df)):
    if df['stop'][i].month==6:
        if df['stop'][i].hour-df['start'][i].hour==8 or df['stop'][i].hour-df['start'][i].hour== -16:
            #print(df['start'][i])
            #print(df['stop'][i])
            print(df['name'][i])

Oliver Williams
William Taylor
Oliver Davies
James Thomas

In [29]:
newdf['start']=pd.to_timedelta(newdf['start'])
newdf['stop']=pd.to_timedelta(newdf['stop'])
newdf['name'][newdf['stop']-newdf['start']==pd.Timedelta('8 hours')]

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Passing datetime64-dtype data to TimedeltaIndex is deprecated, will raise a TypeError in a future version
  """Entry point for launching an IPython kernel.
/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning: Passing datetime64-dtype data to TimedeltaIndex is deprecated, will raise a TypeError in a future version

869     Oliver Williams
1704     William Taylor
2093      Oliver Davies
3379       James Thomas
Name: name, dtype: object

# Q8

In [30]:
for i in range(len(df)):
    if df['stop'][i].month==6:
        if df['stop'][i].hour-df['start'][i].hour>=9 or \
        (df['stop'][i].day-df['start'][i].day==1 and \
         df['start'][i].hour-df['stop'][i].hour<=15) or \
        df['stop'][i].day-df['start'][i].day>1:
            #print(df['start'][i])
            #print(df['stop'][i])
            print(df['name'][i])

Thomas Davies
Jack Johnson
Charlie Brown
William Evans

In [31]:
newdf['name'][newdf['stop']-newdf['start']>=pd.Timedelta('9 hours')]

209     Thomas Davies
1101     Jack Johnson
2266    Charlie Brown
3095    William Evans
Name: name, dtype: object

# Q9

In [32]:
total=0
for i in range(len(df)):
    if df['stop'][i].month==6:
        if df['stop'][i].day-df['start'][i].day==0:
            total+=df['stop'][i].hour-df['start'][i].hour
        if df['stop'][i].day-df['start'][i].day==1:
            total+=df['stop'][i].hour+(24-df['start'][i].hour)
            #print(df['stop'][i].hour+(24-df['start'][i].hour))
        if df['stop'][i].day-df['start'][i].day>1:
            total
print(f'total time: {total} hours')
print(f'total time: {total//24} day {total%24} hours')

total time: 1412 hours
total time: 58 day 20 hours

In [33]:
#sum(newdf['stop']-newdf['start'])
(newdf['stop']-newdf['start']).sum()

Timedelta('58 days 20:00:00')